# GetLocalPlacement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..GetLocalPlacement Method
IFCExtrusionCreationData Class See Also
---
Gets the reference to the IfcLocalPlacement handle used when creating the extrusion.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCAnyHandle GetLocalPlacement()
```

Visual Basic
---
```text
Public Function GetLocalPlacement As IFCAnyHandle
```

Visual C++
---
```text
public:
IFCAnyHandle^ GetLocalPlacement()
```

# ### Return Value
The IfcLocalPlacement handle.
# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace